Repository: Rundiz-WP/rundizstrap-companion
Catalog: languages/bbfse-plug-*.po
Languages: th

source: A plugin that contain blocks for Bootstrap Basic FSE theme. All blocks based on Bootstrap CSS.
th: ปลั๊กอินที่มีบล็อกสำหรับธีม Bootstrap Basic FSE. บล็อกทั้งหมดสร้างขึ้นจาก CSS ของ Bootstrap.

source: Settings configuration file was not set.
th: ไฟล์การกำหนดค่าการตั้งค่าไม่ได้ถูกตั้งค่าไว้.

source: BBFSE Plug help
th: ความช่วยเหลือของ BBFSE Plug

source: DB version %s
th: รุ่นฐานข้อมูล %s

source: Donate
th: บริจาค

source: Your WordPress version does not meet the minimum requirement. (%1$s < %2$s).
th: เวอร์ชัน WordPress ของคุณไม่ตรงความต้องการขั้นต่ำ (%1$s < %2$s).

source: Unable to network activate, please activate per site only.
th: ไม่สามารถเปิดใช้งานผ่านเครือข่ายได้, โปรดเปิดใช้งานทีละไซต์เท่านั้น.

source: Please reload this page and try again.
th: โปรดรีเฟรชหน้านี้แล้วลองใหม่อีกครั้ง.

source: An error has been occur, cannot continue manual update. Please contact plugin author.
th: เกิดข้อผิดพลาดขึ้น, ไม่สามารถดำเนินการอัปเดตด้วยตนเองต่อได้. โปรดติดต่อผู้พัฒนาปลั๊กอิน.

source: Success, please click next to continue update.
th: สำเร็จแล้ว โปรดคลิกถัดไปเพื่อดำเนินการอัปเดตต่อ.

source: All manual update completed successfully. This page will be no longer available until there is next manual update.
th: การอัปเดตด้วยตนเองทั้งหมดเสร็จสมบูรณ์แล้ว. หน้าเว็บนี้จะไม่สามารถใช้งานได้อีกต่อไปจนกว่าจะมีการอัปเดตด้วยตนเองครั้งต่อไป.

source: Unable to run update, there is no update classes to run.
th: ไม่สามารถดำเนินการอัปเดตได้, เนื่องจากไม่มีคลาสสำหรับการอัปเดตให้เรียกใช้.

source: The Bootstrap Basic FSE Plugin is just upgraded and need to be manually update. Please continue to the %1$splugin update page%2$s.
th: ปลั๊กอิน Bootstrap Basic FSE เพิ่งได้รับการอัปเกรดและจำเป็นต้องอัปเดตด้วยตนเอง. โปรดดำเนินการต่อที่ %1$sหน้าอัปเดตปลั๊กอิน%2$s.

source: Bootstrap Basic FSE Plugin update
th: อัปเดตปลั๊กอิน Bootstrap Basic FSE

source: Completed
th: สำเร็จแล้ว

source: Dismiss
th: รับทราบ

source: Next
th: ถัดไป

source: Bootstrap Basic FSE Plugin settings
th: ตั้งค่าปลั๊กอิน Bootstrap Basic FSE

source: The manual update is required, please %1$supdate first%2$s.
th: จำเป็นต้องอัปเดตด้วยตนเอง โปรด %1$supdate ก่อน%2$s.

source: The manual update is required, please tell administrator to update first.
th: จำเป็นต้องอัปเดตด้วยตนเอง โปรดแจ้งให้ผู้ดูแลระบบทำการอัปเดตก่อน.

source: Home
th: หน้าแรก

source: (Untitled)
th: (ไม่มีไตเติล)

source: The views file was not found (%s).
th: ไม่พบไฟล์ views (%s).

source: Upload
th: อัปโหลด

source: Remove
th: เอาออก

source: Navbar
th: แถบนำทาง

source: The navbar consists of 4 parts.
th: แถบนำทางประกอบด้วย 4 ส่วน.

source: Bootstrap navbar container
th: คอนเทนเนอร์แถบนำทาง Bootstrap

source: Bootstrap navbar toggler button
th: ปุ่มสลับแถบนำทาง Bootstrap

source: Bootstrap navbar responsive wrapper
th: ตัวหุ้มแถบนำทาง Bootstrap ที่ตอบสนองต่อขนาดหน้าจอ

source: Bootstrap navbar navigation
th: การนำทางด้วยแถบนำทาง Bootstrap

source: Navbar brand
th: แบรนด์ของแถบนำทาง

source: To use %1$s, you can use WordPress core row block and add class %1$s to it. Then you can add site logo, site title into row.
th: ในการใช้ %1$s, คุณสามารถใช้บล็อกแถว (row) หลักของ WordPress และเพิ่มคลาส %1$s เข้าไป. จากนั้นคุณสามารถเพิ่มโลโก้เว็บไซต์และชื่อเว็บไซต์ลงในแถว (row) ได้.

source: Navbar dropdown
th: แถบนำทางแบบดรอปดาวน์

source: To use dropdown menu divider, add class %1$s to sub menu item in %2$s in the site editor.
th: ในการใช้ตัวแบ่งเมนูแบบดรอปดาวน์, ให้เพิ่มคลาส %1$s ให้กับรายการเมนูย่อยใน %2$s ในโปรแกรมแก้ไขไซต์.

source: Navigation
th: การนำทาง

source: To use dropdown menu header, add class %1$s to sub menu item in %2$s in the site editor.
th: ในการใช้ส่วนหัวเมนูแบบดรอปดาวน์, ให้เพิ่มคลาส %1$s ให้กับรายการเมนูย่อยใน %2$s ในโปรแกรมแก้ไขไซต์.

source: Manual update
th: อัปเดตด้วยตนเอง

source: There are total %d actions for this manual update, please continue step by step.
th: การอัปเดตด้วยตนเองครั้งนี้มีทั้งหมด %d ขั้นตอน, โปรดดำเนินการต่อทีละขั้นตอน.

source: You are running %1$s of %2$d.
th: คุณกำลังใช้งาน %1$s ของ %2$d.

source: Start
th: เริ่ม

source: Example of how to access settings values in option db.
th: ตัวอย่างวิธีการเข้าถึงค่าการตั้งค่าในฐานข้อมูล option.

source: Call to %s
th: เรียกไปยัง %s

source: Access this variable as global %s. This variable will be change, up to config in AppTrait.
th: เข้าถึงตัวแปรนี้โดยใช้ global %s. ตัวแปรนี้จะเปลี่ยนแปลงไปตามการตั้งค่าใน AppTrait.

source: Now, you can use this variable to access its array key anywhere.
th: ตอนนี้คุณสามารถใช้ตัวแปรนี้เพื่อเข้าถึงคีย์ของอาร์เรย์ได้ทุกที่.

source: Name
th: ชื่อ

source: Email
th: อีเมล

source: Website
th: เว็บไซต์

source: Save my name, email, and website in this browser for the next time I comment.
th: บันทึกชื่อ อีเมล และเว็บไซต์ของฉันลงในเบราว์เซอร์นี้สำหรับการแสดงความคิดเห็นครั้งต่อไป.

source: Comment
th: ความคิดเห็น

source: Your email address will not be published.
th: ที่อยู่อีเมลของคุณจะไม่ถูกเผยแพร่.

source: This navigation is empty.
th: เมนูนำทางนี้ว่างเปล่า

source: Next »
th: ถัดไป »

source: « Previous
th: « ก่อนหน้า

source: Previous
th: ก่อนหน้า

source: Pagination
th: การแบ่งหน้า

# label for next post link
source: Next
th: ถัดไป

# label for previous post link
source: Previous
th: ก่อนหน้า

source: (no title)
th: (ไม่มีไตเติล)

source: Search
th: ค้นหา

source: Value
th: ค่า

source: Add attribute
th: เพิ่มแอตทริบิวต์ aria

source: Default
th: ค่าเริ่มต้น

source: Please add an href value when using <a>.
th: โปรดเพิ่มค่า href เมื่อใช้ <a>

source: Please ensure the CSS class list contains the Bootstrap class "btn".
th: โปรดตรวจสอบให้แน่ใจว่ารายการคลาส CSS มีคลาส Bootstrap "btn" อยู่ด้วย.

source: Button Settings
th: ตั้งค่าปุ่ม

source: Tag Name
th: ชื่อแท็ก

source: Button text/HTML
th: ข้อความ/HTML ของปุ่ม

source: You can use text or HTML, e.g. <i class="bi bi-save"></i> Save
th: คุณสามารถใช้ข้อความหรือ HTML ได้, เช่น <i class="bi bi-save"></i> บันทึก

source: Link Attributes
th: แอตทริบิวต์ลิงก์

source: Required when using <a>.
th: จำเป็นต้องใช้เมื่อใช้ <a>.

source: Tab index
th: ดัชนีแท็บ

source: Button Attributes
th: แอตทริบิวต์ของปุ่ม

source: Form ID
th: ฟอร์ม ID

source: ID of the form this button is associated with.
th: ID ของแบบฟอร์มที่ปุ่มนี้เกี่ยวข้องด้วย.

source: Learn more
th: เรียนรู้เพิ่มเติม

source: Form enctype
th: ฟอร์ม enctype

source: Form method
th: ฟอร์ม method

source: Form novalidate
th: ฟอร์ม novalidate

source: Form target
th: เป้าหมายของฟอร์ม

source: Target for form submission, e.g. _blank.
th: เป้าหมายสำหรับการส่งแบบฟอร์ม เช่น _blank.

# Button name
source: Name
th: ชื่อ

source: Data and Aria Attributes
th: แอตทริบิวต์ของ Data และ Aria

source: Data attributes
th: แอตทริบิวต์ data

source: Aria attributes
th: แอตทริบิวต์ aria

source: HTML element
th: องค์ประกอบ HTML

source: Default (<div>)
th: ค่าเริ่มต้น (<div>)

source: Please add a Bootstrap column class (e.g. "col", "col-md-6") in the "Additional CSS class(es)" field under Advanced settings.
th: โปรดเพิ่มคลาสคอลัมน์ของ Bootstrap (เช่น "col", "col-md-6") ในช่อง "คลาส CSS เพิ่มเติม" ภายใต้การตั้งค่าขั้นสูง.

source: Comment Form Settings
th: การตั้งค่าฟอร์มแสดงความคิดเห็น

source: Button class
th: คลาสปุ่ม

source: Replace submit button class, e.g. btn btn-outline-primary
th: เปลี่ยนคลาสของปุ่มส่งข้อมูล. เช่น btn btn-outline-primary

source: Leave a Reply
th: แสดงคำตอบกลับ

source: Post Comment
th: แสดงความคิดเห็น

source: Please add a Bootstrap container class (e.g. "container", "container-fluid") in the "Additional CSS class(es)" field under Advanced settings.
th: โปรดเพิ่ม container ของ Bootstrap (เช่น "container", "container-fluid") ในช่อง "คลาส CSS เพิ่มเติม" ภายใต้การตั้งค่าขั้นสูง.

source: Navbar Settings
th: การตั้งค่าแถบนำทาง

source: Container Settings
th: การตั้งค่าคอนเทนเนอร์

source: Container Tag Name
th: ชื่อแท็กคอนเทนเนอร์

source: Container Class
th: คลาสคอนเทนเนอร์

source: Default is container-fluid. You can change to container, container-lg, etc.
th: ค่าเริ่มต้นคือ container-fluid. คุณสามารถเปลี่ยนเป็น container, container-lg เป็นต้นได้.

source: Container data attributes
th: แอตทริบิวต์ data ของคอนเทนเนอร์

source: Container aria attributes
th: แอตทริบิวต์ aria ของคอนเทนเนอร์

source: Auto: first available
th: อัตโนมัติ: รายการแรกที่พบ

source: Navigation Settings
th: การตั้งค่าการนำทาง

source: Select a Navigation post or leave auto to use the first available.
th: เลือกโพสต์สำหรับการนำทาง หรือปล่อยให้เป็นอัตโนมัติเพื่อใช้โพสต์แรกที่พบ.

source: Create a new navigation
th: สร้างเมนูนำทางใหม่

source: Manage all navigations
th: จัดการการนำทางทั้งหมด

source: No Navigation posts found. Create one in the Site Editor > Navigation.
th: ไม่พบโพสต์การนำทาง. สร้างโพสต์ใหม่ได้ในตัวแก้ไขเว็บไซต์ > การนำทาง.

source: Dropdown menu class
th: คลาสเมนูแบบดรอปดาวน์

source: Additional classes for dropdown menu. The base class `dropdown-menu` is always applied.
th: คลาสเพิ่มเติมสำหรับเมนูแบบดรอปดาวน์. โดยคลาสพื้นฐาน `dropdown-menu` จะถูกนำมาใช้เสมอ.

source: No Navigation posts found to preview.
th: ไม่พบโพสต์เกี่ยวกับการนำทางเพื่อดูตัวอย่าง.

source: Navbar responsive wrapper Settings
th: การตั้งค่าแถบนำทางแบบตอบสนอง

source: Navbar responsive wrapper
th: ตัวหุ้มแถบนำทางแบบตอบสนอง

source: Please note that the preview will not display with styles so that editing can work.
th: โปรดทราบว่าตัวอย่างจะไม่แสดงสไตล์ เพื่อให้สามารถแก้ไขได้.

source: Wrapper style
th: รูปแบบตัวหุ้ม

source: Offcanvas Settings
th: การตั้งค่า offcanvas

source: Navbar responsive offcanvas
th: แถบนำทางแบบตอบสนอง offcanvas

source: Offcanvas header Class
th: คลาสส่วนหัว offcanvas

source: Default is %1$s.
th: ค่าเริ่มต้นคือ %1$s.

source: Offcanvas header title ID
th: ไอดีไตเติลส่วนหัวของ offcanvas

source: HTML id attribute on offcanvas header title
th: แอตทริบิวต์ id ของ HTML บนส่วนหัวของ offcanvas

source: Offcanvas header title Class
th: คลาสไตเติลส่วนหัวของ offcanvas

source: Offcanvas header title text
th: ข้อความไตเติลส่วนหัวของ offcanvas

source: You can use text or HTML. This will be display inside offcanvas title.
th: คุณสามารถใช้ข้อความหรือ HTML ได้. นี่จะแสดงผลภายในส่วนหัวของ offcanvas.

source: Close button additional Class
th: คลาสเพิ่มเติมของปุ่มปิด

source: This will be additional class next to main close button class.
th: นี่จะเป็นคลาสเพิ่มเติมที่อยู่ถัดจากคลาสปุ่มปิดหลัก.

source: Close button data attributes
th: แอตทริบิวต์ data ของปุ่มปิด

source: Close button aria attributes
th: แอตทริบิวต์ aria ของปุ่มปิด

source: Offcanvas body Class
th: คลาสร่างกาย offcanvas

source: Icon Settings
th: ตั้งค่าไอคอน

source: Icon Additional Class(es)
th: ไอคอน คลาสเพิ่มเติม

source: Add additional classes to the icon span.
th: เพิ่มคลาสเพิ่มเติมให้กับไอคอน span.

source: Icon data attributes
th: แอตทริบิวต์ data ของไอคอน

source: Icon aria attributes
th: แอตทริบิวต์ aria ของไอคอน

source: Default (Start)
th: ค่าเริ่มต้น (จุดเริ่ม)

source: Center
th: กลาง

source: End
th: จุดสิ้นสุด

source: Settings
th: ตั้งค่า

source: Show previous/next buttons
th: แสดงปุ่มก่อนหน้า/ถัดไป

source: Previous button text
th: ข้อความปุ่มก่อนหน้า

source: Previous button text/HTML
th: ข้อความ/HTML ของปุ่มก่อนหน้า

source: You can use HTML for icons, e.g. <i class="bi bi-chevron-left"></i>
th: คุณสามารถใช้ HTML สำหรับไอคอนได้, เช่น <i class="bi bi-chevron-left"></i>

source: Next button text
th: ข้อความปุ่มถัดไป

source: Next button text/HTML
th: ข้อความ/HTML ของปุ่มถัดไป

source: You can use HTML for icons, e.g. <i class="bi bi-chevron-right"></i>
th: คุณสามารถใช้ HTML สำหรับไอคอนได้, เช่น <i class="bi bi-chevron-right"></i>

source: Show page numbers
th: แสดงหมายเลขหน้า

source: Number of adjacent pages
th: จำนวนหน้าติดกัน

source: Specify how many links can appear before and after the current page number. Links to the first, current and last page are always visible.
th: ระบุจำนวนลิงก์ที่สามารถปรากฏก่อนและหลังหมายเลขหน้าปัจจุบัน. ลิงก์ไปยังหน้าแรก หน้าปัจจุบัน และหน้าสุดท้ายจะแสดงอยู่เสมอ.

source: Alignment
th: การจัดแนว

source: Additional CSS class
th: คลาส CSS เพิ่มเติม

source: Add extra CSS classes to the pagination container.
th: เพิ่มคลาส CSS เพิ่มเติมให้กับ container การแบ่งหน้า.

source: Page navigation preview
th: ตัวอย่างการนำทางหน้าเว็บ

source: Bootstrap Previous Post
th: Bootstrap โพสต์ก่อนหน้า

source: Displays the post link that precedes the current post in Bootstrap style.
th: แสดงลิงก์ของโพสต์ก่อนหน้าโพสต์ปัจจุบันในรูปแบบ Bootstrap.

source: Previous post
th: โพสต์ก่อนหน้า

source: Bootstrap Next Post
th: Bootstrap โพสต์ถัดไป

source: Displays the post link that follows the current post in Bootstrap style.
th: แสดงลิงก์โพสต์ที่ต่อจากโพสต์ปัจจุบันในรูปแบบ Bootstrap.

source: Next post
th: โพสต์ถัดไป

source: An example title
th: ตัวอย่างชื่อเรื่อง

source: Unfiltered (default)
th: ไม่ผ่านการกรอง (ค่าเริ่มต้น)

source: Display the title as a link
th: แสดงชื่อเรื่องเป็นลิงก์

source: This will be replace custom label.
th: อันนี้จะใช้แทนป้ายกำกับแบบกำหนดเอง.

source: Prepend text/HTML
th: ข้อความ/HTML ที่จะนำหน้า

source: Text or HTML to prepend before the link text.
th: ข้อความหรือโค้ด HTML ที่จะเพิ่มไว้ข้างหน้าข้อความลิงก์.

source: Append text/HTML
th: ข้อความ/HTML ที่จะต่อท้าย

source: Text or HTML to append after the link text.
th: ข้อความหรือโค้ด HTML ที่จะเพิ่มต่อท้ายข้อความลิงก์.

source: Filter by taxonomy
th: กรองตามการแยกประเภท

source: Only link to posts that have the same taxonomy terms as the current post. For example the same tags or categories.
th: ลิงก์เฉพาะโพสต์ที่มีหมวดหมู่หรือคำจัดหมวดหมู่เดียวกันกับโพสต์ปัจจุบันเท่านั้น. ตัวอย่างเช่น แท็กหรือหมวดหมู่เดียวกัน.

source: Button outside
th: ปุ่มด้านนอก

source: Button group with input
th: กลุ่มของปุ่มพร้อมช่องป้อนข้อมูล

source: No button
th: ไม่มีปุ่ม

source: For navbar
th: สำหรับแถบนำทาง

source: Show label
th: แสดงป้ายกำกับ

source: Button position
th: ตำแหน่งปุ่ม

source: Button use icon
th: ปุ่มใช้ไอคอน

source: Button classes
th: คลาสปุ่ม

source: Optional placeholder text
th: ข้อความตัวอย่าง (ไม่บังคับ)

source: Optional placeholder…
th: ช่องว่างสำหรับใส่ข้อมูลเพิ่มเติม (ไม่จำเป็น)...

source: Button text
th: ข้อความบนปุ่ม

source: Add button text…
th: เพิ่มข้อความบนปุ่ม...

source: Label text
th: ข้อความป้ายกำกับ

source: Add label…
th: เพิ่มป้ายกำกับ…

# block description
source: Render Bootstrap button. This block is in the BBFSE plugin.
th: แสดงผลปุ่ม Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: button
th: ปุ่ม

# block keyword
source: link
th: ลิ้งค์

# block title
source: Bootstrap button
th: ปุ่ม Bootstrap

# block description
source: Render Bootstrap column. This block is in the BBFSE plugin.
th: แสดงผลคอลัมน์ Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: layout
th: เค้าโครง

# block keyword
source: wrapper
th: ตัวหุ้ม

# block title
source: Bootstrap layout column
th: คอลัมน์เลย์เอาต์ Bootstrap

# block description
source: Display post comment form in Bootstrap style. This block is in the BBFSE plugin.
th: แสดงแบบฟอร์มแสดงความคิดเห็นในสไตล์ Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: comment
th: ความคิดเห็น

# block keyword
source: form
th: ฟอร์ม

# block title
source: Bootstrap comment form
th: แบบฟอร์มแสดงความคิดเห็น Bootstrap

# block description
source: Render Bootstrap container. This block is in the BBFSE plugin.
th: แสดงผล container ของ Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block title
source: Bootstrap layout container
th: เลย์เอาต์ container ของ Bootstrap

# block description
source: Bootstrap navbar container. This block is in the BBFSE plugin.
th: คอนเทนเนอร์แถบนำทางของ Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: navbar
th: แถบนำทาง

# block title
source: Bootstrap navbar container
th: คอนเทนเนอร์แถบนำทาง Bootstrap

# block description
source: Bootstrap navbar navigation items. This block is in the BBFSE plugin.
th: รายการนำทางในแถบนำทางของ Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: navigation
th: การนำทาง

# block keyword
source: menu
th: เมนู

# block title
source: Bootstrap navbar navigation
th: การนำทางด้วยแถบนำทาง Bootstrap

# block description
source: Wrap the navbar items with collapse or offcanvas. This block is in the BBFSE plugin.
th: ห่อหุ้มรายการในแถบนำทางด้วยการยุบ หรือ offcanvas. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: responsive
th: ตอบสนอง

# block keyword
source: collapse
th: ยุบ

# block title
source: Bootstrap navbar responsive wrapper
th: ตัวหุ้มแถบนำทาง Bootstrap ที่ตอบสนองต่อขนาดหน้าจอ

# block description
source: Bootstrap navbar toggler button. This block is in the BBFSE plugin.
th: ปุ่มสลับแถบนำทาง Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: toggler
th: ตัวสลับ

# block title
source: Bootstrap Navbar Toggler Button
th: ปุ่มสลับแถบนำทาง Bootstrap

# block description
source: Display pagination in Bootstrap style. This block is in the BBFSE plugin.
th: แสดงการแบ่งหน้าในรูปแบบ Bootstrap บล็อกนี้อยู่ในปลั๊กอิน BBFSE

# block keyword
source: pages
th: หน้า

# block keyword
source: pagination
th: การแบ่งหน้า

# block title
source: Bootstrap pagination
th: การแบ่งหน้าแบบ Bootstrap

# block description
source: Displays the next or previous post link in Bootstrap style. This block is in the BBFSE plugin.
th: แสดงลิงก์ไปยังโพสต์ถัดไปหรือโพสต์ก่อนหน้าในรูปแบบ Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: post
th: โพสต์

# block keyword
source: next
th: ถัดไป

# block keyword
source: previous
th: ก่อนหน้า

# block title
source: Bootstrap post navigation link
th: ลิงก์นำทางโพสต์ Bootstrap

# block description
source: Render Bootstrap row. This block is in the BBFSE plugin.
th: แสดงผลแถว Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block title
source: Bootstrap layout row
th: แถวเลย์เอาต์ Bootstrap

# block description
source: Display search form in Bootstrap style. This block is in the BBFSE plugin.
th: แสดงฟอร์มค้นหาในรูปแบบของ Bootstrap. บล็อกนี้อยู่ในปลั๊กอิน BBFSE.

# block keyword
source: find
th: หา

# block title
source: Bootstrap search form
th: แบบฟอร์มค้นหา Bootstrap
